In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [6]:
data = pd.read_csv('Salaries.csv')

In [7]:
data.shape

(148654, 13)

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [10]:
data.tail(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [11]:
data.shape

(148654, 13)

In [13]:
data['JobTitle'].value_counts().head(10)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Custodian                       2418
TRANSIT OPERATOR                2388
Firefighter                     2359
Recreation Leader               1971
Patient Care Assistant          1945
Name: JobTitle, dtype: int64

In [14]:
data['Year'].value_counts()

2014    38123
2013    37606
2012    36766
2011    36159
Name: Year, dtype: int64

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [16]:
data.isna().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

In [19]:
data[data['Year'].apply(lambda x : x == 2014)].head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
110531,110532,David Shinn,Deputy Chief 3,129150.01,0.0,342802.63,38780.04,471952.64,510732.68,2014,NaN,San Francisco,PT
110532,110533,Amy P Hart,Asst Med Examiner,318835.49,10712.95,60563.54,89540.23,390111.98,479652.21,2014,NaN,San Francisco,FT
110533,110534,William J Coaker Jr.,Chief Investment Officer,257340.0,0.0,82313.7,96570.66,339653.70,436224.36,2014,NaN,San Francisco,PT
110534,110535,Gregory P Suhr,Chief of Police,307450.04,0.0,19266.72,91302.46,326716.76,418019.22,2014,NaN,San Francisco,FT
110535,110536,Joanne M Hayes-White,"Chief, Fire Department",302068.0,0.0,24165.44,91201.66,326233.44,417435.10,2014,NaN,San Francisco,FT

In [20]:
lst = []
for year in data['Year']:
    if year == 2014:
        lst.append(lst)
print(len(lst))

38123

In [21]:
data.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

In [23]:
data.drop(['Id', 'Notes', 'Agency','Status'], inplace=True, axis=1)

In [24]:
data.head()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011

In [25]:
data.shape

(148654, 9)

In [26]:
data.isnull().sum()

EmployeeName            0
JobTitle                0
BasePay               605
OvertimePay             0
OtherPay                0
Benefits            36159
TotalPay                0
TotalPayBenefits        0
Year                    0
dtype: int64

In [28]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [29]:
data.describe()

            TotalPay  TotalPayBenefits           Year
count  148654.000000     148654.000000  148654.000000
mean    74768.321972      93692.554811    2012.522643
std     50517.005274      62793.533483       1.117538
min      -618.130000       -618.130000    2011.000000
25%     36168.995000      44065.650000    2012.000000
50%     71426.610000      92404.090000    2013.000000
75%    105839.135000     132876.450000    2014.000000
max    567595.430000     567595.430000    2014.000000

In [30]:
data.dtypes

EmployeeName         object
JobTitle             object
BasePay              object
OvertimePay          object
OtherPay             object
Benefits             object
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
dtype: object

In [31]:
data.head()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011

In [44]:
data.describe(include='all')

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,148654,148654,148049.0,148654.0,148654.0,112495.0,148654.000000,148654.000000,148654.000000
unique,110811,2159,109900.0,66555.0,84968.0,99635.0,NaN,NaN,NaN
top,Kevin Lee,Transit Operator,0.0,0.0,0.0,0.0,NaN,NaN,NaN
freq,13,7036,875.0,66103.0,35218.0,1053.0,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,74768.321972,93692.554811,2012.522643
std,NaN,NaN,NaN,NaN,NaN,NaN,50517.005274,62793.533483,1.117538
min,NaN,NaN,NaN,NaN,NaN,NaN,-618.130000,-618.130000,2011.000000
25%,NaN,NaN,NaN,NaN,NaN,NaN,36168.995000,44065.650000,2012.000000
50%,NaN,NaN,NaN,NaN,NaN,NaN,71426.610000,92404.090000,2013.000000
75%,NaN,NaN,NaN,NaN,NaN,NaN,105839.135000,132876.450000,2014.000000
max,NaN,NaN,NaN,NaN,NaN,NaN,567595.430000,567595.430000,2014.000000

In [45]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [49]:
data['EmployeeName'].value_counts().head(20)

Kevin Lee            13
Richard Lee          11
Steven Lee           11
William Wong         11
Michael Wong          9
Stanley Lee           9
KEVIN LEE             9
John Chan             9
William Lee           8
RICHARD LEE           8
David Wong            8
MICHAEL LEE           8
DAVID WONG            8
Victor Lee            8
STEVEN LEE            7
Amelie E Bullard      7
John Miller           7
STANLEY LEE           7
Michael A Johnson     7
Sandy Wong            7
Name: EmployeeName, dtype: int64

In [52]:
len(data['JobTitle'].value_counts())

2159

In [57]:
data[data['JobTitle'].str.contains('Captain', case=False)]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011
11,PATRICIA JACKSON,CAPTAIN III (POLICE DEPARTMENT),99722.0,87082.62,110804.3,NaN,297608.92,297608.92,2011
17,SEBASTIAN WONG,"CAPTAIN, EMERGENCYCY MEDICAL SERVICES",140546.87,119397.26,18625.08,NaN,278569.21,278569.21,2011
22,GEORGE GARCIA,"CAPTAIN, FIRE SUPPRESSION",140546.88,93200.58,39955.25,NaN,273702.71,273702.71,2011
...,...,...,...,...,...,...,...,...,...
116604,Gregory L Stewart,"Captain, Fire Suppression",73355.21,18517.18,49917.73,25608.77,141790.12,167398.89,2014
120867,Michael J Moran,Captain 3,7660.0,1496.09,126560.36,2189.51,135716.45,137905.96,2014
122361,Michael V Rolovich,"Captain, Fire Suppression",0.0,0.0,130320.75,0.0,130320.75,130320.75,2014
126588,Stephen M Tittel,Captain 3,68491.89,0.0,23721.91,19020.79,92213.80,111234.59,2014
132232,Jeanne M Seyler,"Captain, Fire Suppression",61039.43,2285.30,7548.29,20113.76,70873.02,90986.78,2014

In [62]:
data[data['JobTitle'].str.contains('Fire', case=False)]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011
6,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.9,134426.14,NaN,315981.05,315981.05,2011
8,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011
9,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.0,0.0,17115.73,NaN,302377.73,302377.73,2011
10,ARTHUR KENNEY,"ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",194999.39,71344.88,33149.9,NaN,299494.17,299494.17,2011
...,...,...,...,...,...,...,...,...,...
145956,Kenneth C Farris,Firefighter,0.00,0.00,0.00,4645.56,0.00,4645.56,2014
147556,Edward A Dunn,Firefighter,1063.24,0.00,132.90,385.66,1196.14,1581.80,2014
148021,Kari A Johnson,Firefighter,688.71,0.00,0.00,143.39,688.71,832.10,2014
148209,Sheryl K Lee,Firefighter,459.14,0.00,0.00,95.59,459.14,554.73,2014
148554,Lawrence F Gatt,Fire Alarm Dispatcher,73.33,0.00,0.00,0.73,73.33,74.06,2014

In [63]:
data.dtypes

EmployeeName         object
JobTitle             object
BasePay              object
OvertimePay          object
OtherPay             object
Benefits             object
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
dtype: object

In [70]:
data['BasePay'].str.contains('not provided', case=False).index

RangeIndex(start=0, stop=148654, step=1)

In [71]:
data['BasePay'].replace('Not Provided', np.nan, inplace=True)

In [72]:
data['BasePay'].str.contains('Not provided', case=False).count()

17578

In [73]:
data['BasePay'].unique()

array([167411.18, 155966.02, 212739.13, ..., '17.26', '6.04', '15.50'],
      dtype=object)

In [80]:
data['BasePay'] = data['BasePay'].astype(float)

In [81]:
data.dtypes

EmployeeName         object
JobTitle             object
BasePay             float64
OvertimePay          object
OtherPay             object
Benefits             object
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
dtype: object

In [76]:
data.isnull().sum()

EmployeeName            0
JobTitle                0
BasePay               609
OvertimePay             0
OtherPay                0
Benefits            36159
TotalPay                0
TotalPayBenefits        0
Year                    0
dtype: int64

In [82]:
data.dtypes

EmployeeName         object
JobTitle             object
BasePay             float64
OvertimePay          object
OtherPay             object
Benefits             object
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
dtype: object

In [84]:
data['BasePay'].describe()

count    148045.000000
mean      66325.448841
std       42764.635495
min        -166.010000
25%       33588.200000
50%       65007.450000
75%       94691.050000
max      319275.010000
Name: BasePay, dtype: float64

In [96]:
data[data.isnull().sum(axis=1) == 1].tail(10)

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
110521,Chinaenye E Nwachukwu,Environmental Service Worker,NaN,0.0,10.69,1.45,10.69,12.14,2013
110522,Mengru Chen,Environmental Service Worker,NaN,0.0,10.69,1.45,10.69,12.14,2013
110523,Mouy Him,Environmental Service Worker,NaN,0.0,10.69,1.45,10.69,12.14,2013
110524,Roberto A Perez Lima,Environmental Service Worker,NaN,0.0,9.98,1.35,9.98,11.33,2013
110525,Darius T Gardner,Environmental Service Worker,NaN,0.0,9.98,1.35,9.98,11.33,2013
110526,Arthur L Curry,PS Aide Health Services,NaN,0.0,10.67,0.0,10.67,10.67,2013
110527,Nereida Vega,Senior Clerk,NaN,0.0,5.56,0.0,5.56,5.56,2013
110528,Timothy E Gibson,Police Officer 3,NaN,0.0,0.0,-2.73,0.00,-2.73,2013
110529,Mark E Laherty,Police Officer 3,NaN,0.0,0.0,-8.2,0.00,-8.20,2013
110530,David P Kucia,Police Officer 3,NaN,0.0,0.0,-33.89,0.00,-33.89,2013

In [92]:
data.isnull().sum()

EmployeeName            0
JobTitle                0
BasePay               609
OvertimePay             0
OtherPay                0
Benefits            36159
TotalPay                0
TotalPayBenefits        0
Year                    0
dtype: int64

In [93]:
data['Benefits'] = data['Benefits'].replace('Not Provided',np.nan)

In [94]:
data.isnull().sum()

EmployeeName            0
JobTitle                0
BasePay               609
OvertimePay             0
OtherPay                0
Benefits            36163
TotalPay                0
TotalPayBenefits        0
Year                    0
dtype: int64

In [95]:
36163-36159

4

In [97]:
data.shape

(148654, 9)

In [101]:
data.drop(data[data.isnull().sum(axis=1)==1].index, inplace=True)

In [102]:
data.isnull().sum()

EmployeeName        0
JobTitle            0
BasePay             4
OvertimePay         0
OtherPay            0
Benefits            4
TotalPay            0
TotalPayBenefits    0
Year                0
dtype: int64

In [110]:
data['Benefits'].value_counts().head(20)

0.0         915
0.00        681
4659.36     107
25699.2      83
37055.22     82
27052.98     70
37025.18     60
36097.33     57
34150.93     53
38280.39     51
35884.33     51
39396.66     49
36412.57     47
35445.1      44
25954.76     44
26642.48     43
37040.2      43
7464.70      43
41406.59     40
41858.98     40
Name: Benefits, dtype: int64

In [111]:
data.isnull().sum()

EmployeeName        0
JobTitle            0
BasePay             4
OvertimePay         0
OtherPay            0
Benefits            4
TotalPay            0
TotalPayBenefits    0
Year                0
dtype: int64

In [114]:
data.drop(data[data['BasePay']==np.nan].index, axis=0, inplace=True)

In [117]:
data.shape

(111890, 9)

In [118]:
data.dropna(inplace=True)

In [119]:
data.isnull().sum()

EmployeeName        0
JobTitle            0
BasePay             0
OvertimePay         0
OtherPay            0
Benefits            0
TotalPay            0
TotalPayBenefits    0
Year                0
dtype: int64

In [120]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [122]:
data[data['JobTitle'].str.contains('albertpardini', case=False)]

Empty DataFrame
Columns: [EmployeeName, JobTitle, BasePay, OvertimePay, OtherPay, Benefits, TotalPay, TotalPayBenefits, Year]
Index: []

In [124]:
data['JobTitle'].head(20)

36159      Lieutenant, Fire Suppression
36160                   Chief of Police
36161       Electronic Maintenance Tech
36162            Chief, Fire Department
36163         EMT/Paramedic/Firefighter
36164                       Dept Head V
36165        Gen Mgr, Public Trnsp Dept
36166                       Dept Head V
36167                         Captain 3
36168      Asst Chf of Dept (Fire Dept)
36169    Battlion Chief, Fire Suppressi
36170    Battlion Chief, Fire Suppressi
36171    Battlion Chief, Fire Suppressi
36172    Battlion Chief, Fire Suppressi
36173          Assistant Deputy Chief 2
36174                 Transit Manager 2
36175                 Asst Med Examiner
36176       Dep Chf of Dept (Fire Dept)
36177       Executive Contract Employee
36178                 Asst Med Examiner
Name: JobTitle, dtype: object

In [125]:
data[data['EmployeeName']=='ALBERT PARDINI']

Empty DataFrame
Columns: [EmployeeName, JobTitle, BasePay, OvertimePay, OtherPay, Benefits, TotalPay, TotalPayBenefits, Year]
Index: []

In [126]:
data.head(5)

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
36159,Gary Altenberg,"Lieutenant, Fire Suppression",128808.87,220909.48,13126.31,44430.12,362844.66,407274.78,2012
36160,Gregory Suhr,Chief of Police,302578.00,0.0,18974.11,69810.19,321552.11,391362.30,2012
36161,Khoa Trinh,Electronic Maintenance Tech,111921.00,146415.32,78057.41,53102.29,336393.73,389496.02,2012
36162,Joanne Hayes-White,"Chief, Fire Department",296943.01,0.0,17816.59,72047.88,314759.60,386807.48,2012
36163,Frederick Binkley,EMT/Paramedic/Firefighter,126863.19,192424.49,17917.18,44438.25,337204.86,381643.11,2012

In [127]:
data[data['EmployeeName'] == 'Gregory Suhr']['']

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
36160,Gregory Suhr,Chief of Police,302578.0,0.0,18974.11,69810.19,321552.11,391362.3,2012

In [139]:
data['BasePay'].max()

319275.01

In [142]:
data[data['BasePay'].max()==data['BasePay']]['EmployeeName']

72925    Gregory P Suhr
Name: EmployeeName, dtype: object

BasePay              67207.558425
TotalPay             76128.778458
TotalPayBenefits    101243.122968
Year                  2013.012093
dtype: float64

In [145]:
yr = data.groupby('Year')

In [146]:
yr.mean()

           BasePay      TotalPay  TotalPayBenefits
Year
2012  65436.406857  74113.262265     100553.229232
2013  69630.030216  78808.285041     102939.981346
2014  66564.421924  75471.836912     100261.438668

In [147]:
data.groupby('Year').mean()

           BasePay      TotalPay  TotalPayBenefits
Year
2012  65436.406857  74113.262265     100553.229232
2013  69630.030216  78808.285041     102939.981346
2014  66564.421924  75471.836912     100261.438668

In [148]:
data['JobTitle'].nunique()

1109

In [149]:
data.groupby('JobTitle').mean()

,BasePay,TotalPay,TotalPayBenefits,Year
JobTitle,,,,
"ACPO,JuvP, Juv Prob (SFERS)",62290.780000,62290.780000,80266.370000,2014.000000
ASR Senior Office Specialist,60551.580167,63519.363167,90124.237333,2013.083333
ASR-Office Assistant,41253.471951,41511.501951,60762.093659,2013.097561
Account Clerk,42372.579396,43145.753774,63246.342000,2013.030189
Accountant I,61777.832500,62036.101250,88122.188750,2012.875000
...,...,...,...,...
Wire Rope Cable Maint Sprv,92751.746667,203033.720000,242118.323333,2013.000000
Worker's Comp Supervisor 1,68867.296429,70389.297143,96125.531429,2013.071429
Worker's Compensation Adjuster,72363.278784,73249.269865,101321.425811,2013.040541
X-Ray Laboratory Aide,46086.387100,50823.942700,69521.123200,2013.040000
Youth Comm Advisor,39077.957500,41414.307500,60118.550000,2013.000000

In [153]:
data[data['JobTitle'].str.contains('accountant', case=False)].mean()['BasePay']

75336.18288798911

In [156]:
data[data['JobTitle']=='ACCOUNTANT']

Empty DataFrame
Columns: [EmployeeName, JobTitle, BasePay, OvertimePay, OtherPay, Benefits, TotalPay, TotalPayBenefits, Year]
Index: []

In [158]:
data[data['JobTitle'].str.contains('accountant',case=False)]['JobTitle']

43535      Accountant IV
43554      Accountant IV
44061      Accountant IV
44062      Accountant IV
44586      Accountant IV
               ...
143492     Accountant IV
143766     Accountant IV
144811     Accountant II
146288    Accountant III
148174    Accountant III
Name: JobTitle, Length: 741, dtype: object

In [162]:
data['JobTitle'].nunique()

1109

In [164]:
data['JobTitle'].value_counts().head(10)

Transit Operator                6975
Special Nurse                   4382
Registered Nurse                3725
Public Svc Aide-Public Works    2514
Police Officer 3                2411
Custodian                       2409
Firefighter                     2348
Recreation Leader               1968
Patient Care Assistant          1940
Deputy Sheriff                  1914
Name: JobTitle, dtype: int64